import { Grid, styled, Typography } from "@mui/material";
import React from "react";

export const AboutUs = () => {
  const Title = styled(Typography)(({ theme }) => ({
    fontSize: "24px",
    fontWeigh: 700,
    [theme.breakpoints.between("xs", "md")]: {
      fontSize: "14px",
      fontWeigh: 700,
      color: "#00A693",
      alignSelf: "start",
      padding: "20px 0 0 20px",
    },
  }));
  const CustomGrid = styled(Grid)(({ theme }) => ({
    margin: "100px 0 20px 0",
    justifyContent: "center",
    alignItems: "center",
    gap: "50px",
    padding: "10px",
    [theme.breakpoints.between("xs", "md")]: {
      justifyContent: "unset",
      background: "url(/images/back-mobile.png)",
      margin: "50px 0 20px 0",
      gap: "20px",
    },
  }));
  const Description = styled(Typography)(({ theme }) => ({
    fontSize: "16px",
    fontWeight: 600,
    width: "1260px",
    height: "auto",
    textAlign: "justify",
    lineHeight: "230%",
    [theme.breakpoints.between("md", "lg")]: {
      fontSize: "14px",
      width: "100%",
      padding: "0 20px 50px 20px",
    },
    [theme.breakpoints.between("xs", "md")]: {
      width: "100%",
      padding: "0 20px 50px 20px",
      fontSize: "10px",
      lineHeight: "220%",
    },
  }));
  return (
    <CustomGrid container direction="column">
      <Title>درباره ما</Title>
      <Description>
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
        از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
        سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای
        متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
        درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با
        نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان
        خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید
        داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان
        رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات
        پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. <br /> لورم
        ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از
        طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
        سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای
        متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
        درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با
        نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان
        خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید
        داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان
        رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات
        پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
        <br />
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده
        از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و
        سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای
        متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه
        درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با
        نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان
        خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید
        داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان
        رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات
        پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
      </Description>
    </CustomGrid>
  );
};
